app/views/home/index.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 1 AND "roles"."name" = 'SuperUser' LIMIT 1
---
<% if user_signed_in? %>
  <h3>Welcome <%= @current_user.name %> (<%= @current_user.roles.first.name %>) </h3>