app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 20
---
  def index
    #authorize! :index, @user, :message => 'Not authorized as an administrator.'
    if can? :manage, User
      @users = User.paginate(:page => params[:page])